NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
#ifndef NRF54H_ERRATAS_H
#define NRF54H_ERRATAS_H

/*

Copyright (c) 2010 - 2026, Nordic Semiconductor ASA All rights reserved.

SPDX-License-Identifier: BSD-3-Clause

Redistribution and use in source and binary forms, with or without
modification, are permitted provided that the following conditions are met:

1. Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

2. Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the
   documentation and/or other materials provided with the distribution.

3. Neither the name of Nordic Semiconductor ASA nor the names of its
   contributors may be used to endorse or promote products derived from this
   software without specific prior written permission.

THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
IMPLIED WARRANTIES OF MERCHANTABILITY, AND FITNESS FOR A PARTICULAR PURPOSE
ARE DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
POSSIBILITY OF SUCH DAMAGE.

*/

#include <stdint.h>
#include <stdbool.h>
#include "../common/compiler_abstraction.h"

static inline bool nrf54h_errata_8(void);
static inline bool nrf54h_errata_12(void);
static inline bool nrf54h_errata_13(void);
static inline bool nrf54h_errata_14(void);
static inline bool nrf54h_errata_19(void);
static inline bool nrf54h_errata_20(void);
static inline bool nrf54h_errata_21(void);
static inline bool nrf54h_errata_23(void);
static inline bool nrf54h_errata_26(void);
static inline bool nrf54h_errata_31(void);
static inline bool nrf54h_errata_32(void);
static inline bool nrf54h_errata_34(void);
static inline bool nrf54h_errata_35(void);
static inline bool nrf54h_errata_36(void);
static inline bool nrf54h_errata_37(void);
static inline bool nrf54h_errata_39(void);
static inline bool nrf54h_errata_40(void);
static inline bool nrf54h_errata_41(void);
static inline bool nrf54h_errata_42(void);
static inline bool nrf54h_errata_43(void);
static inline bool nrf54h_errata_44(void);
static inline bool nrf54h_errata_45(void);
static inline bool nrf54h_errata_46(void);
static inline bool nrf54h_errata_47(void);
static inline bool nrf54h_errata_50(void);
static inline bool nrf54h_errata_51(void);
static inline bool nrf54h_errata_53(void);
static inline bool nrf54h_errata_55(void);
static inline bool nrf54h_errata_57(void);
static inline bool nrf54h_errata_58(void);
static inline bool nrf54h_errata_62(void);
static inline bool nrf54h_errata_63(void);
static inline bool nrf54h_errata_64(void);
static inline bool nrf54h_errata_65(void);
static inline bool nrf54h_errata_66(void);
static inline bool nrf54h_errata_67(void);
static inline bool nrf54h_errata_69(void);
static inline bool nrf54h_errata_72(void);
static inline bool nrf54h_errata_73(void);
static inline bool nrf54h_errata_74(void);
static inline bool nrf54h_errata_75(void);
static inline bool nrf54h_errata_76(void);
static inline bool nrf54h_errata_77(void);
static inline bool nrf54h_errata_78(void);
static inline bool nrf54h_errata_84(void);
static inline bool nrf54h_errata_92(void);
static inline bool nrf54h_errata_93(void);
static inline bool nrf54h_errata_103(void);
static inline bool nrf54h_errata_104(void);
static inline bool nrf54h_errata_105(void);
static inline bool nrf54h_errata_106(void);
static inline bool nrf54h_errata_107(void);
static inline bool nrf54h_errata_109(void);
static inline bool nrf54h_errata_110(void);
static inline bool nrf54h_errata_111(void);
static inline bool nrf54h_errata_112(void);
static inline bool nrf54h_errata_115(void);
static inline bool nrf54h_errata_116(void);
static inline bool nrf54h_errata_117(void);
static inline bool nrf54h_errata_118(void);
static inline bool nrf54h_errata_119(void);
static inline bool nrf54h_errata_120(void);
static inline bool nrf54h_errata_121(void);
static inline bool nrf54h_errata_122(void);
static inline bool nrf54h_errata_123(void);
static inline bool nrf54h_errata_124(void);
static inline bool nrf54h_errata_125(void);
static inline bool nrf54h_errata_126(void);
static inline bool nrf54h_errata_127(void);
static inline bool nrf54h_errata_128(void);
static inline bool nrf54h_errata_129(void);
static inline bool nrf54h_errata_130(void);
static inline bool nrf54h_errata_131(void);
static inline bool nrf54h_errata_132(void);
static inline bool nrf54h_errata_133(void);
static inline bool nrf54h_errata_134(void);
static inline bool nrf54h_errata_135(void);
static inline bool nrf54h_errata_136(void);
static inline bool nrf54h_errata_137(void);
static inline bool nrf54h_errata_138(void);
static inline bool nrf54h_errata_139(void);
static inline bool nrf54h_errata_140(void);
static inline bool nrf54h_errata_141(void);
static inline bool nrf54h_errata_142(void);
static inline bool nrf54h_errata_143(void);
static inline bool nrf54h_errata_146(void);
static inline bool nrf54h_errata_148(void);
static inline bool nrf54h_errata_149(void);
static inline bool nrf54h_errata_151(void);
static inline bool nrf54h_errata_152(void);
static inline bool nrf54h_errata_156(void);
static inline bool nrf54h_errata_157(void);
static inline bool nrf54h_errata_158(void);
static inline bool nrf54h_errata_159(void);
static inline bool nrf54h_errata_160(void);
static inline bool nrf54h_errata_161(void);
static inline bool nrf54h_errata_162(void);
static inline bool nrf54h_errata_163(void);
static inline bool nrf54h_errata_165(void);
static inline bool nrf54h_errata_166(void);
static inline bool nrf54h_errata_169(void);
static inline bool nrf54h_errata_171(void);
static inline bool nrf54h_errata_173(void);
static inline bool nrf54h_errata_175(void);
static inline bool nrf54h_errata_177(void);
static inline bool nrf54h_errata_178(void);
static inline bool nrf54h_errata_179(void);
static inline bool nrf54h_errata_182(void);
static inline bool nrf54h_errata_184(void);
static inline bool nrf54h_errata_185(void);
static inline bool nrf54h_errata_186(void);
static inline bool nrf54h_errata_187(void);
static inline bool nrf54h_errata_190(void);
static inline bool nrf54h_errata_192(void);
static inline bool nrf54h_errata_193(void);
static inline bool nrf54h_errata_194(void);
static inline bool nrf54h_errata_195(void);
static inline bool nrf54h_errata_196(void);
static inline bool nrf54h_errata_198(void);
static inline bool nrf54h_errata_200(void);
static inline bool nrf54h_errata_201(void);
static inline bool nrf54h_errata_202(void);
static inline bool nrf54h_errata_205(void);
static inline bool nrf54h_errata_206(void);
static inline bool nrf54h_errata_207(void);
static inline bool nrf54h_errata_208(void);
static inline bool nrf54h_errata_209(void);
static inline bool nrf54h_errata_210(void);
static inline bool nrf54h_errata_212(void);
static inline bool nrf54h_errata_213(void);
static inline bool nrf54h_errata_216(void);
static inline bool nrf54h_errata_217(void);
static inline bool nrf54h_errata_218(void);
static inline bool nrf54h_errata_229(void);
static inline bool nrf54h_errata_230(void);
static inline bool nrf54h_errata_231(void);
static inline bool nrf54h_errata_233(void);
static inline bool nrf54h_errata_234(void);
static inline bool nrf54h_errata_235(void);
static inline bool nrf54h_errata_236(void);
static inline bool nrf54h_errata_237(void);
static inline bool nrf54h_errata_238(void);
static inline bool nrf54h_errata_239(void);
static inline bool nrf54h_errata_241(void);
static inline bool nrf54h_errata_242(void);
static inline bool nrf54h_errata_243(void);
static inline bool nrf54h_errata_244(void);
static inline bool nrf54h_errata_245(void);
static inline bool nrf54h_errata_253(void);
static inline bool nrf54h_errata_254(void);
static inline bool nrf54h_errata_256(void);
static inline bool nrf54h_errata_271(void);
static inline bool nrf54h_errata_272(void);
static inline bool nrf54h_errata_273(void);
static inline bool nrf54h_errata_274(void);
static inline bool nrf54h_errata_275(void);
static inline bool nrf54h_errata_277(void);
static inline bool nrf54h_errata_278(void);
static inline bool nrf54h_errata_279(void);
static inline bool nrf54h_errata_280(void);

