NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
/* ========= Errata 8 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_8_PRESENT 1
#else
    #define NRF54H_ERRATA_8_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_8_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_8_ENABLE_WORKAROUND NRF54H_ERRATA_8_PRESENT
#endif

static inline bool nrf54h_errata_8(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 12 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_12_PRESENT 1
#else
    #define NRF54H_ERRATA_12_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_12_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_12_ENABLE_WORKAROUND NRF54H_ERRATA_12_PRESENT
#endif

static inline bool nrf54h_errata_12(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 13 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_13_PRESENT 1
#else
    #define NRF54H_ERRATA_13_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_13_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_13_ENABLE_WORKAROUND NRF54H_ERRATA_13_PRESENT
#endif

static inline bool nrf54h_errata_13(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 14 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_14_PRESENT 1
#else
    #define NRF54H_ERRATA_14_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_14_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_14_ENABLE_WORKAROUND NRF54H_ERRATA_14_PRESENT
#endif

static inline bool nrf54h_errata_14(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 19 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_19_PRESENT 1
#else
    #define NRF54H_ERRATA_19_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_19_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_19_ENABLE_WORKAROUND NRF54H_ERRATA_19_PRESENT
#endif

static inline bool nrf54h_errata_19(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 20 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_20_PRESENT 1
#else
    #define NRF54H_ERRATA_20_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_20_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_20_ENABLE_WORKAROUND NRF54H_ERRATA_20_PRESENT
#endif

static inline bool nrf54h_errata_20(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 21 ========= */
#define NRF54H_ERRATA_21_PRESENT 0

#ifndef NRF54H_ERRATA_21_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_21_ENABLE_WORKAROUND NRF54H_ERRATA_21_PRESENT
#endif

static inline bool nrf54h_errata_21(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 23 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_23_PRESENT 1
#else
    #define NRF54H_ERRATA_23_PRESENT 0
#endif

