NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
#ifndef NRF54H_ERRATA_37_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_37_ENABLE_WORKAROUND NRF54H_ERRATA_37_PRESENT
#endif

static inline bool nrf54h_errata_37(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 39 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_39_PRESENT 1
#else
    #define NRF54H_ERRATA_39_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_39_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_39_ENABLE_WORKAROUND NRF54H_ERRATA_39_PRESENT
#endif

static inline bool nrf54h_errata_39(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 40 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_40_PRESENT 1
#else
    #define NRF54H_ERRATA_40_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_40_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_40_ENABLE_WORKAROUND NRF54H_ERRATA_40_PRESENT
#endif

static inline bool nrf54h_errata_40(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 41 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_41_PRESENT 1
#else
    #define NRF54H_ERRATA_41_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_41_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_41_ENABLE_WORKAROUND NRF54H_ERRATA_41_PRESENT
#endif

static inline bool nrf54h_errata_41(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 42 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_42_PRESENT 1
#else
    #define NRF54H_ERRATA_42_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_42_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_42_ENABLE_WORKAROUND NRF54H_ERRATA_42_PRESENT
#endif

static inline bool nrf54h_errata_42(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 43 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_43_PRESENT 1
#else
    #define NRF54H_ERRATA_43_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_43_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_43_ENABLE_WORKAROUND NRF54H_ERRATA_43_PRESENT
#endif

static inline bool nrf54h_errata_43(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 44 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_44_PRESENT 1
#else
    #define NRF54H_ERRATA_44_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_44_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_44_ENABLE_WORKAROUND NRF54H_ERRATA_44_PRESENT
#endif

static inline bool nrf54h_errata_44(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 45 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_45_PRESENT 1
#else
    #define NRF54H_ERRATA_45_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_45_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_45_ENABLE_WORKAROUND NRF54H_ERRATA_45_PRESENT
#endif

static inline bool nrf54h_errata_45(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 46 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_46_PRESENT 1
#else
    #define NRF54H_ERRATA_46_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_46_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_46_ENABLE_WORKAROUND NRF54H_ERRATA_46_PRESENT
#endif

