NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
/* ========= Errata 62 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_62_PRESENT 1
#else
    #define NRF54H_ERRATA_62_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_62_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_62_ENABLE_WORKAROUND NRF54H_ERRATA_62_PRESENT
#endif

static inline bool nrf54h_errata_62(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 63 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_63_PRESENT 1
#else
    #define NRF54H_ERRATA_63_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_63_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_63_ENABLE_WORKAROUND NRF54H_ERRATA_63_PRESENT
#endif

static inline bool nrf54h_errata_63(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 64 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_64_PRESENT 1
#else
    #define NRF54H_ERRATA_64_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_64_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_64_ENABLE_WORKAROUND NRF54H_ERRATA_64_PRESENT
#endif

static inline bool nrf54h_errata_64(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 65 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_65_PRESENT 1
#else
    #define NRF54H_ERRATA_65_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_65_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_65_ENABLE_WORKAROUND NRF54H_ERRATA_65_PRESENT
#endif

static inline bool nrf54h_errata_65(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 66 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_66_PRESENT 1
#else
    #define NRF54H_ERRATA_66_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_66_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_66_ENABLE_WORKAROUND NRF54H_ERRATA_66_PRESENT
#endif

static inline bool nrf54h_errata_66(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 67 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_67_PRESENT 1
#else
    #define NRF54H_ERRATA_67_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_67_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_67_ENABLE_WORKAROUND NRF54H_ERRATA_67_PRESENT
#endif

static inline bool nrf54h_errata_67(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 69 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_69_PRESENT 1
#else
    #define NRF54H_ERRATA_69_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_69_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_69_ENABLE_WORKAROUND NRF54H_ERRATA_69_PRESENT
#endif

