NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
#ifndef NRF54H_ERRATA_92_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_92_ENABLE_WORKAROUND NRF54H_ERRATA_92_PRESENT
#endif

static inline bool nrf54h_errata_92(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 93 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_93_PRESENT 1
#else
    #define NRF54H_ERRATA_93_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_93_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_93_ENABLE_WORKAROUND NRF54H_ERRATA_93_PRESENT
#endif

static inline bool nrf54h_errata_93(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 103 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_103_PRESENT 1
#else
    #define NRF54H_ERRATA_103_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_103_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_103_ENABLE_WORKAROUND NRF54H_ERRATA_103_PRESENT
#endif

static inline bool nrf54h_errata_103(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 104 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_104_PRESENT 1
#else
    #define NRF54H_ERRATA_104_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_104_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_104_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54h_errata_104(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 105 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_105_PRESENT 1
#else
    #define NRF54H_ERRATA_105_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_105_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_105_ENABLE_WORKAROUND NRF54H_ERRATA_105_PRESENT
#endif

static inline bool nrf54h_errata_105(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 106 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_106_PRESENT 1
#else
    #define NRF54H_ERRATA_106_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_106_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_106_ENABLE_WORKAROUND NRF54H_ERRATA_106_PRESENT
#endif

static inline bool nrf54h_errata_106(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 107 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_107_PRESENT 1
#else
    #define NRF54H_ERRATA_107_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_107_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_107_ENABLE_WORKAROUND NRF54H_ERRATA_107_PRESENT
#endif

static inline bool nrf54h_errata_107(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 109 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_109_PRESENT 1
#else
    #define NRF54H_ERRATA_109_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_109_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_109_ENABLE_WORKAROUND NRF54H_ERRATA_109_PRESENT
#endif

