NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
/* ========= Errata 118 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_118_PRESENT 1
#else
    #define NRF54H_ERRATA_118_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_118_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_118_ENABLE_WORKAROUND NRF54H_ERRATA_118_PRESENT
#endif

static inline bool nrf54h_errata_118(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 119 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_119_PRESENT 1
#else
    #define NRF54H_ERRATA_119_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_119_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_119_ENABLE_WORKAROUND NRF54H_ERRATA_119_PRESENT
#endif

static inline bool nrf54h_errata_119(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 120 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_120_PRESENT 1
#else
    #define NRF54H_ERRATA_120_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_120_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_120_ENABLE_WORKAROUND NRF54H_ERRATA_120_PRESENT
#endif

static inline bool nrf54h_errata_120(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 121 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_121_PRESENT 1
#else
    #define NRF54H_ERRATA_121_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_121_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_121_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54h_errata_121(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 122 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_122_PRESENT 1
#else
    #define NRF54H_ERRATA_122_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_122_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_122_ENABLE_WORKAROUND NRF54H_ERRATA_122_PRESENT
#endif

static inline bool nrf54h_errata_122(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 123 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_123_PRESENT 1
#else
    #define NRF54H_ERRATA_123_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_123_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_123_ENABLE_WORKAROUND NRF54H_ERRATA_123_PRESENT
#endif

static inline bool nrf54h_errata_123(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 124 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_124_PRESENT 1
#else
    #define NRF54H_ERRATA_124_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_124_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_124_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54h_errata_124(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 125 ========= */
#define NRF54H_ERRATA_125_PRESENT 0

#ifndef NRF54H_ERRATA_125_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_125_ENABLE_WORKAROUND NRF54H_ERRATA_125_PRESENT
#endif

static inline bool nrf54h_errata_125(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 126 ========= */
#define NRF54H_ERRATA_126_PRESENT 0

