NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
#ifndef NRF54H_ERRATA_126_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_126_ENABLE_WORKAROUND NRF54H_ERRATA_126_PRESENT
#endif

static inline bool nrf54h_errata_126(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 127 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_127_PRESENT 1
#else
    #define NRF54H_ERRATA_127_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_127_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_127_ENABLE_WORKAROUND NRF54H_ERRATA_127_PRESENT
#endif

static inline bool nrf54h_errata_127(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 128 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_128_PRESENT 1
#else
    #define NRF54H_ERRATA_128_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_128_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_128_ENABLE_WORKAROUND NRF54H_ERRATA_128_PRESENT
#endif

static inline bool nrf54h_errata_128(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 129 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_129_PRESENT 1
#else
    #define NRF54H_ERRATA_129_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_129_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_129_ENABLE_WORKAROUND NRF54H_ERRATA_129_PRESENT
#endif

static inline bool nrf54h_errata_129(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 130 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_130_PRESENT 1
#else
    #define NRF54H_ERRATA_130_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_130_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_130_ENABLE_WORKAROUND NRF54H_ERRATA_130_PRESENT
#endif

static inline bool nrf54h_errata_130(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 131 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_131_PRESENT 1
#else
    #define NRF54H_ERRATA_131_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_131_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_131_ENABLE_WORKAROUND NRF54H_ERRATA_131_PRESENT
#endif

static inline bool nrf54h_errata_131(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 132 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_132_PRESENT 1
#else
    #define NRF54H_ERRATA_132_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_132_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_132_ENABLE_WORKAROUND NRF54H_ERRATA_132_PRESENT
#endif

static inline bool nrf54h_errata_132(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

