NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
/* ========= Errata 133 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_133_PRESENT 1
#else
    #define NRF54H_ERRATA_133_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_133_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_133_ENABLE_WORKAROUND NRF54H_ERRATA_133_PRESENT
#endif

static inline bool nrf54h_errata_133(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 134 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_134_PRESENT 1
#else
    #define NRF54H_ERRATA_134_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_134_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_134_ENABLE_WORKAROUND NRF54H_ERRATA_134_PRESENT
#endif

static inline bool nrf54h_errata_134(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 135 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_135_PRESENT 1
#else
    #define NRF54H_ERRATA_135_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_135_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_135_ENABLE_WORKAROUND NRF54H_ERRATA_135_PRESENT
#endif

static inline bool nrf54h_errata_135(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 136 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_136_PRESENT 1
#else
    #define NRF54H_ERRATA_136_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_136_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_136_ENABLE_WORKAROUND NRF54H_ERRATA_136_PRESENT
#endif

static inline bool nrf54h_errata_136(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 137 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_137_PRESENT 1
#else
    #define NRF54H_ERRATA_137_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_137_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_137_ENABLE_WORKAROUND NRF54H_ERRATA_137_PRESENT
#endif

static inline bool nrf54h_errata_137(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 138 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_138_PRESENT 1
#else
    #define NRF54H_ERRATA_138_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_138_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_138_ENABLE_WORKAROUND NRF54H_ERRATA_138_PRESENT
#endif

static inline bool nrf54h_errata_138(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 139 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_139_PRESENT 1
#else
    #define NRF54H_ERRATA_139_PRESENT 0
#endif

