NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
#ifndef NRF54H_ERRATA_151_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_151_ENABLE_WORKAROUND NRF54H_ERRATA_151_PRESENT
#endif

static inline bool nrf54h_errata_151(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 152 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_152_PRESENT 1
#else
    #define NRF54H_ERRATA_152_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_152_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_152_ENABLE_WORKAROUND NRF54H_ERRATA_152_PRESENT
#endif

static inline bool nrf54h_errata_152(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 156 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_156_PRESENT 1
#else
    #define NRF54H_ERRATA_156_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_156_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_156_ENABLE_WORKAROUND NRF54H_ERRATA_156_PRESENT
#endif

static inline bool nrf54h_errata_156(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 157 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_157_PRESENT 1
#else
    #define NRF54H_ERRATA_157_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_157_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_157_ENABLE_WORKAROUND NRF54H_ERRATA_157_PRESENT
#endif

static inline bool nrf54h_errata_157(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 158 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_158_PRESENT 1
#else
    #define NRF54H_ERRATA_158_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_158_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_158_ENABLE_WORKAROUND NRF54H_ERRATA_158_PRESENT
#endif

static inline bool nrf54h_errata_158(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 159 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_159_PRESENT 1
#else
    #define NRF54H_ERRATA_159_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_159_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_159_ENABLE_WORKAROUND NRF54H_ERRATA_159_PRESENT
#endif

static inline bool nrf54h_errata_159(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 160 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_160_PRESENT 1
#else
    #define NRF54H_ERRATA_160_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_160_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_160_ENABLE_WORKAROUND NRF54H_ERRATA_160_PRESENT
#endif

