NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
/* ========= Errata 185 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_185_PRESENT 1
#else
    #define NRF54H_ERRATA_185_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_185_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_185_ENABLE_WORKAROUND NRF54H_ERRATA_185_PRESENT
#endif

static inline bool nrf54h_errata_185(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 186 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_186_PRESENT 1
#else
    #define NRF54H_ERRATA_186_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_186_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_186_ENABLE_WORKAROUND NRF54H_ERRATA_186_PRESENT
#endif

static inline bool nrf54h_errata_186(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 187 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_187_PRESENT 1
#else
    #define NRF54H_ERRATA_187_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_187_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_187_ENABLE_WORKAROUND NRF54H_ERRATA_187_PRESENT
#endif

static inline bool nrf54h_errata_187(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 190 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_190_PRESENT 1
#else
    #define NRF54H_ERRATA_190_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_190_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_190_ENABLE_WORKAROUND NRF54H_ERRATA_190_PRESENT
#endif

static inline bool nrf54h_errata_190(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 192 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_192_PRESENT 1
#else
    #define NRF54H_ERRATA_192_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_192_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_192_ENABLE_WORKAROUND NRF54H_ERRATA_192_PRESENT
#endif

static inline bool nrf54h_errata_192(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 193 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_193_PRESENT 1
#else
    #define NRF54H_ERRATA_193_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_193_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_193_ENABLE_WORKAROUND NRF54H_ERRATA_193_PRESENT
#endif

static inline bool nrf54h_errata_193(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 194 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_194_PRESENT 1
#else
    #define NRF54H_ERRATA_194_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_194_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_194_ENABLE_WORKAROUND NRF54H_ERRATA_194_PRESENT
#endif

static inline bool nrf54h_errata_194(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

