NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
/* ========= Errata 195 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_195_PRESENT 1
#else
    #define NRF54H_ERRATA_195_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_195_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_195_ENABLE_WORKAROUND NRF54H_ERRATA_195_PRESENT
#endif

static inline bool nrf54h_errata_195(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 196 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_196_PRESENT 1
#else
    #define NRF54H_ERRATA_196_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_196_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_196_ENABLE_WORKAROUND NRF54H_ERRATA_196_PRESENT
#endif

static inline bool nrf54h_errata_196(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 198 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_198_PRESENT 1
#else
    #define NRF54H_ERRATA_198_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_198_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_198_ENABLE_WORKAROUND NRF54H_ERRATA_198_PRESENT
#endif

static inline bool nrf54h_errata_198(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 200 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_200_PRESENT 1
#else
    #define NRF54H_ERRATA_200_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_200_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_200_ENABLE_WORKAROUND NRF54H_ERRATA_200_PRESENT
#endif

static inline bool nrf54h_errata_200(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 201 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_201_PRESENT 1
#else
    #define NRF54H_ERRATA_201_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_201_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_201_ENABLE_WORKAROUND NRF54H_ERRATA_201_PRESENT
#endif

static inline bool nrf54h_errata_201(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 202 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_202_PRESENT 1
#else
    #define NRF54H_ERRATA_202_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_202_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_202_ENABLE_WORKAROUND NRF54H_ERRATA_202_PRESENT
#endif

static inline bool nrf54h_errata_202(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 205 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_205_PRESENT 1
#else
    #define NRF54H_ERRATA_205_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_205_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_205_ENABLE_WORKAROUND NRF54H_ERRATA_205_PRESENT
#endif

static inline bool nrf54h_errata_205(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 206 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_206_PRESENT 1
#else
    #define NRF54H_ERRATA_206_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_206_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_206_ENABLE_WORKAROUND NRF54H_ERRATA_206_PRESENT
#endif

