NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
static inline bool nrf54h_errata_206(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 207 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_207_PRESENT 1
#else
    #define NRF54H_ERRATA_207_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_207_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_207_ENABLE_WORKAROUND NRF54H_ERRATA_207_PRESENT
#endif

static inline bool nrf54h_errata_207(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 208 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_208_PRESENT 1
#else
    #define NRF54H_ERRATA_208_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_208_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_208_ENABLE_WORKAROUND NRF54H_ERRATA_208_PRESENT
#endif

static inline bool nrf54h_errata_208(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 209 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_209_PRESENT 1
#else
    #define NRF54H_ERRATA_209_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_209_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_209_ENABLE_WORKAROUND NRF54H_ERRATA_209_PRESENT
#endif

static inline bool nrf54h_errata_209(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 210 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_210_PRESENT 1
#else
    #define NRF54H_ERRATA_210_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_210_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_210_ENABLE_WORKAROUND NRF54H_ERRATA_210_PRESENT
#endif

static inline bool nrf54h_errata_210(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 212 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_212_PRESENT 1
#else
    #define NRF54H_ERRATA_212_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_212_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_212_ENABLE_WORKAROUND NRF54H_ERRATA_212_PRESENT
#endif

static inline bool nrf54h_errata_212(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 213 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_213_PRESENT 1
#else
    #define NRF54H_ERRATA_213_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_213_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_213_ENABLE_WORKAROUND NRF54H_ERRATA_213_PRESENT
#endif

static inline bool nrf54h_errata_213(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 216 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_216_PRESENT 1
#else
    #define NRF54H_ERRATA_216_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_216_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_216_ENABLE_WORKAROUND NRF54H_ERRATA_216_PRESENT
#endif

static inline bool nrf54h_errata_216(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

