NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
/* ========= Errata 217 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_217_PRESENT 1
#else
    #define NRF54H_ERRATA_217_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_217_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_217_ENABLE_WORKAROUND NRF54H_ERRATA_217_PRESENT
#endif

static inline bool nrf54h_errata_217(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 218 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_218_PRESENT 1
#else
    #define NRF54H_ERRATA_218_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_218_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_218_ENABLE_WORKAROUND NRF54H_ERRATA_218_PRESENT
#endif

static inline bool nrf54h_errata_218(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 229 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_229_PRESENT 1
#else
    #define NRF54H_ERRATA_229_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_229_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_229_ENABLE_WORKAROUND NRF54H_ERRATA_229_PRESENT
#endif

static inline bool nrf54h_errata_229(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 230 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_230_PRESENT 1
#else
    #define NRF54H_ERRATA_230_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_230_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_230_ENABLE_WORKAROUND NRF54H_ERRATA_230_PRESENT
#endif

static inline bool nrf54h_errata_230(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 231 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_231_PRESENT 1
#else
    #define NRF54H_ERRATA_231_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_231_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_231_ENABLE_WORKAROUND NRF54H_ERRATA_231_PRESENT
#endif

static inline bool nrf54h_errata_231(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 233 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_233_PRESENT 1
#else
    #define NRF54H_ERRATA_233_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_233_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_233_ENABLE_WORKAROUND NRF54H_ERRATA_233_PRESENT
#endif

static inline bool nrf54h_errata_233(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 234 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_234_PRESENT 1
#else
    #define NRF54H_ERRATA_234_PRESENT 0
#endif

