NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
#ifndef NRF54H_ERRATA_234_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_234_ENABLE_WORKAROUND NRF54H_ERRATA_234_PRESENT
#endif

static inline bool nrf54h_errata_234(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 235 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_235_PRESENT 1
#else
    #define NRF54H_ERRATA_235_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_235_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_235_ENABLE_WORKAROUND NRF54H_ERRATA_235_PRESENT
#endif

static inline bool nrf54h_errata_235(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 236 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_236_PRESENT 1
#else
    #define NRF54H_ERRATA_236_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_236_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_236_ENABLE_WORKAROUND NRF54H_ERRATA_236_PRESENT
#endif

static inline bool nrf54h_errata_236(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 237 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_237_PRESENT 1
#else
    #define NRF54H_ERRATA_237_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_237_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_237_ENABLE_WORKAROUND NRF54H_ERRATA_237_PRESENT
#endif

static inline bool nrf54h_errata_237(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 238 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_238_PRESENT 1
#else
    #define NRF54H_ERRATA_238_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_238_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_238_ENABLE_WORKAROUND NRF54H_ERRATA_238_PRESENT
#endif

static inline bool nrf54h_errata_238(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 239 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_239_PRESENT 1
#else
    #define NRF54H_ERRATA_239_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_239_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_239_ENABLE_WORKAROUND NRF54H_ERRATA_239_PRESENT
#endif

static inline bool nrf54h_errata_239(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            uint32_t var1 = *(uint32_t *)0x0FFFE000ul;
            uint32_t var2 = *(uint32_t *)0x0FFFE004ul;
        #endif
        #if defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
            if (var1 == 0x16)
            {
                switch(var2)
                {
                    case 0x02ul:
                        return true;
                    default:
                        return true;
                }
            }
        #endif
        return false;
    #endif
}

/* ========= Errata 241 ========= */
#if    defined (NRF54H20_XXAA) || defined (DEVELOP_IN_NRF54H20)
    #define NRF54H_ERRATA_241_PRESENT 1
#else
    #define NRF54H_ERRATA_241_PRESENT 0
#endif

#ifndef NRF54H_ERRATA_241_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_241_ENABLE_WORKAROUND NRF54H_ERRATA_241_PRESENT
#endif

