NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54h/nrf54h_erratas.h
static inline bool nrf54h_errata_274(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 275 ========= */
#define NRF54H_ERRATA_275_PRESENT 0

#ifndef NRF54H_ERRATA_275_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_275_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54h_errata_275(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 277 ========= */
#define NRF54H_ERRATA_277_PRESENT 0

#ifndef NRF54H_ERRATA_277_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_277_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54h_errata_277(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 278 ========= */
#define NRF54H_ERRATA_278_PRESENT 0

#ifndef NRF54H_ERRATA_278_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_278_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54h_errata_278(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 279 ========= */
#define NRF54H_ERRATA_279_PRESENT 0

#ifndef NRF54H_ERRATA_279_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_279_ENABLE_WORKAROUND 0
#endif

static inline bool nrf54h_errata_279(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

/* ========= Errata 280 ========= */
#define NRF54H_ERRATA_280_PRESENT 0

#ifndef NRF54H_ERRATA_280_ENABLE_WORKAROUND
    #define NRF54H_ERRATA_280_ENABLE_WORKAROUND NRF54H_ERRATA_280_PRESENT
#endif

static inline bool nrf54h_errata_280(void)
{
    #ifndef NRF54H_SERIES
        return false;
    #else
        return false;
    #endif
}

#endif /* NRF54H_ERRATAS_H */
